# **PANDAS**
***************************************

Pandas is a Python library used for working with structured data (like tables, CSVs, Excel sheets).

## Working with DataFrames

In [2]:
import pandas as pd

In [22]:
s = pd.Series([10,20,30,40]) # Series represents a one dimensional labeled array 
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
s = pd.Series([100,200,300], index = ['A','B','C']) # Renaming the indexes
print(s)
print(s['B'])

A    100
B    200
C    300
dtype: int64
200

In [20]:
data = {'Name':['Arya','Ravi','Meera'], # Converting dictionary data into a table
        'Marks':[85,92,78],
        'City':['Pune','Delhi','Mumbai']}
df = pd.DataFrame(data)
df

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [25]:
df1 = df.copy() # Creates a copy of the table 'df' into 'df1'
df1['Grades']=(['A','A+','B'])
df1

    Name  Marks    City Grades
0   Arya     85    Pune      A
1   Ravi     92   Delhi     A+
2  Meera     78  Mumbai      B

In [24]:
print(df)
print()
print(df1)

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [9]:
del df1['Grades']
print(df1)

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [10]:
print(df)
print()
print(df1)

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [13]:
df.loc[1] # Access the record at the particular index location using 'loc'

Name      Ravi
Marks       92
City     Delhi
Name: 1, dtype: object

In [14]:
df.iloc[0:2] # Iterates over the specified range & prints it

   Name  Marks   City
0  Arya     85   Pune
1  Ravi     92  Delhi

In [16]:
df[['Name','City']] # Accessing particular columns

    Name    City
0   Arya    Pune
1   Ravi   Delhi
2  Meera  Mumbai

In [17]:
print(df.loc[1])

Name      Ravi
Marks       92
City     Delhi
Name: 1, dtype: object

In [18]:
df.loc[0:2]

    Name  Marks    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai

In [27]:
df.rename(columns = {'Marks':'Score'}, inplace = True) # Renames the column
df

    Name  Score    City
0   Arya     85    Pune
1   Ravi     92   Delhi
2  Meera     78  Mumbai